EDT/УТ/src/DataProcessors/УстановкаТестовогоРежима/УстановкаТестовогоРежима.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УстановкаТестовогоРежима</name>
  <attributes>
    <name>Режим</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

EDT/УТ/src/InformationRegisters/АдресаАбонентовПолученияУведомлений/АдресаАбонентовПолученияУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АдресаАбонентовПолученияУведомлений</name>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыСобытийУведомленияАбонентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресEmail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/DataProcessors/УстановкаТестовогоРежима/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	АдресаАбонентовПолученияУведомлений.АдресEmail КАК Почта,
	               |	ЛОЖЬ КАК Галка
	               |ИЗ
	               |	РегистрСведений.АдресаАбонентовПолученияУведомлений КАК АдресаАбонентовПолученияУведомлений";
	
	Почта.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНажатие(Команда)
	
	Если Объект.Режим = 1 Тогда
		ТекстВопроса = "Производится установка режима тестовой БД. Продолжить?";
	ИначеЕсли Объект.Режим = 2 Тогда
		ТекстВопроса = "Производится очистка настроек БД. Продолжить?" ;
	Иначе 
		ТекстВопроса = "Выбран режим Рабочей базы. Действия не будут произведены.";
	КонецЕсли;	
	
	Если Объект.Режим = 1 или Объект.Режиим = 2 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(ТекстВопроса, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
    		Возврат;
		КонецЕсли; 
			
		ВыполнитьНаСервере();
		
	Иначе 
		
		ПоказатьПредупреждение(ТекстВопроса,, 60);
		
	КонецЕсли;	
		
		
		
КонецПроцедуры
